Repository: inveniosoftware/invenio-records-rest
Catalog: invenio_records_rest/translations/*/LC_MESSAGES/messages.po
Languages: ar, cs, de, fi, hu, sv, tr

source: Best match
ar: أفضل تطابق
cs: Dle nejlepší shody
de: Beste Übereinstimmung
fi: Paras osuma
hu: Legjobb találat
sv: Bästa matchningen
tr: En iyi eşleşme

source: Most recent
ar: الأحدث
cs: Nejnovější
de: Aktuellste
fi: Uusimmat
hu: Legutóbbi
sv: Senaste
tr: En son

source: Invalid query syntax.
ar: تركيبة جملة البحث غير صالحة.
cs: Neplatná syntaxe dotazu.
de: Invalide Anfrage-Syntax.
fi: Virheellinen kyselyn syntaksi.
hu: Érvénytelen lekérdezési szintaxis.
sv: Ogiltig frågesyntax.
tr: Geçersiz sorgu sözdizimi.

source: Style %(style)s could not be found.
ar: لم يتم العثور على النمط %(style)s.
cs: Styl %(style)s nebyl nalezen.
de: Stil %(style)s konnte nicht gefunden werden.
fi: Tyyliä %(style)s ei löytynyt.
hu: A stílus %(style)s nem található.
sv: Stilen %(style)s kunde inte hittas.
tr: %(style)s stili bulunamadı.

source: PID does not exist.
ar: معرف PID غير موجود.
cs: PID neexistuje.
de: PID existiert nicht.
fi: PID:tä ei ole olemassa.
hu: A PID nem létezik.
sv: PID:en existerar inte.
tr: PID mevcut değil.

source: PID is not registered.
ar: معرف PID لم يقع تسجيله.
cs: PID není registrován.
de: PID ist nicht registriert.
fi: PID ei ole rekisteröity.
hu: A PID nincs regisztrálva.
sv: PID:en är inte registrerad.
tr: PID kayıtlı değil.

source: PID has been deleted.
ar: معرف PID وقع حذفه.
cs: PID byl odstraněn.
de: PID wurde gelöscht.
fi: PID on poistettu.
hu: PID törölve.
sv: PID:en har raderats.
tr: PID silindi.

source: No object assigned to %(pid)s.
ar: لم يتم تعيين أي شيئ object إلى %(pid)s.
cs: K objektu %(pid)s není přiřazen žádný objekt.
de: Kein Objekt zugewiesen zu %(pid)s.
fi: PID:lle %(pid)s ei ole liitetty objektia.
hu: Nincs objektum hozzárendelve a közvetkezőhöz: %(pid)s
sv: Inget objekt tilldelat till%(pid)s.
tr: %(pid)s bloğuna atanan nesne yok.

source: Invalid redirect - pid_type %(pid_type)s endpoint missing.
ar: عملية إعادة توجيه غير صالحة - pid_type %(pid_type)s نقطة النهاية مفقودة.
cs: Neplatné přesměrování - chybí endpoint pro pid_type %(pid_type)s.
de: Ungültige Weiterleitung - pid_type %(pid_type)s-Endpunkt fehlt.
fi: Virheellinen uudelleenohjaus – pid_type %(pid_type)s päätepiste puuttuu.
hu: Érvénytelen átirányítás - pid_type: %(pid_type)s végpont hiányzik.
sv: Ogiltig omdirigering - pid_typen %(pid_type)s slutpunkt saknas.
tr: Geçersiz yönlendirme - %(pid_type)s pid_type uç noktası eksik.

source: PID %(pid)s could not be resolved.
ar: معرف PID %(pid)s لم يتم حله .
cs: PID %(pid)s se nepodařilo rozlišit.
de: PID %(pid)s konnte nicht aufgelöst werden.
fi: PID:tä %(pid)s ei voitu ratkaista.
hu: PID feloldása sikertelen: %(pid)s.
sv: PID %(pid)s kunde inte lösas.
tr: %(pid)s PID'i çözümlenmedi.

source: Unsupported media type "%(content_type)s".
ar: نوع وسائط المعلومات غير مدعوم "%(content_type)s".
cs: Nepodporovaný typ média "%(content_type)s".
de: Nicht unterstützter Medientyp "%(content_type)s".
fi: Ei tuettu mediatyyppi "%(content_type)s”.
hu: Nem támogatott médiatípus: "%(content_type)s"
sv: Mediatyp som inte stöds "%(content_type)s".
tr: Desteklenmeyen "%(content_type)s" ortam türü.

source: Could not load data.
ar: تعذر تحميل البيانات.
cs: Nepodařilo se načíst data.
de: Daten konnten nicht geladen werden.
fi: Tietoja ei voitu ladata.
hu: Adatok betöltése sikertelen.
sv: Det gick inte att ladda data.
tr: Veriler yüklenemedi.

source: Could not patch JSON.
ar: لم يتمكن من تصحيح JSON
cs: Nepodařilo se upravit JSON.
de: JSON konnte nicht gepatcht werden.
fi: JSONia ei voitu päivittää (patch).
hu: JSON frissítése sikertelen.
sv: Det gick inte att patcha JSON.
tr: JSON yaması uygulanamadı.

source: Missing %(ctx_field)s context.
ar: سياق %(ctx_field)s مفقود.
cs: Chybí kontext %(ctx_field)s.
de: Fehlender %(ctx_field)s Kontext.
fi: Konteksti %(ctx_field)s puuttuu.
hu: %(ctx_field)s kontextus hiányzik.
sv: Saknar %(ctx_field)s kontext.
tr: %(ctx_field)s bağlamı eksik.

source: No completions requested.%(options)s
ar: لم يتم طلب أي إتمام.%(options)s
cs: Nebyla požadována žádná dokončení.%(options)s
de: Keine Vervollständigungen angefordert.%(options)s
fi: Täydennyksiä ei pyydetty.%(options)s
hu: Kiegészítés nem lett kérvényezve. %(options)s
sv: Inga kompletteringar begärda.%(options)s
tr: Tamamlanma isteğinde bulunulmadı. %(options)s

source: Validation error: %(error)s.
ar: خطأ في التحقق: %(error)s.
cs: Chyba validace: %(error)s.
de: Validierungsfehler: %(error)s.
fi: Validointivirhe: %(error)s.
hu: Validációs hiba: %(error)s
sv: Valideringsfel: %(error)s.
tr: Doğrulama hatası: %(error)s.

source: An internal server error occurred when handling the request.
ar: حدث خطأ داخلي في الخادم أثناء معالجة الطلب.
cs: Při zpracování požadavku došlo k interní chybě serveru.
de: Ein interner Serverfehler trat beim Verarbeiten der Anfrage auf.
fi: Pyynnön käsittelyssä tapahtui sisäinen palvelinvirhe.
hu: Belső szerver hiba történt a kérés kiszolgálásakor.
sv: Ett internt serverfel uppstod vid hanteringen av begäran.
tr: İsteği işlerken iç bir sunucu hatası oluştu.

source: The syntax of the search query is invalid.
ar: إن صيغة استعلام البحث search query غير صالحة.
cs: Syntaxe dotazu na vyhledávání je neplatná.
de: Die Syntax der Suchanfrage ist ungültig.
fi: Kyselyn syntaksi on virheellinen.
hu: A keresési kifejezés formátuma nem megfelelő.
sv: Syntaxen i sökfrågan är ogiltig.
tr: Arama sorgusunun sözdizimi geçersiz.

source: The query parameters from and page must not be used at the same time.
ar: لا يجوز استخدام إعدادات الاستعلام query parameters من والصفحة في نفس الوقت.
cs: Parametry dotazu "od" a "stránka" nesmí být použity současně.
de: Die Abfrageparameter 'from' und 'page' dürfen nicht gleichzeitig verwendet werden.
fi: Kyselyn parametreja 'from' ja 'page' ei saa käyttää samanaikaisesti.
hu: A "page" és "from" query paraméterek egyszerre történő használata nem megengedett.
sv: Frågeparametrarna 'from' och 'page' får inte användas samtidigt.
tr: Sorgu parametreleri formu ve sayfası aynı anda kullanılmamalıdır.

source: Invalid pagination parameters.
ar: إعدادات الترقيم غير صالحة.
cs: Neplatné parametry stránkování.
de: Ungültige Paginierungsparameter.
fi: Virheelliset sivutusparametrit.
hu: Érvénytelen lapozási paraméterek.
sv: Ogiltiga parametrar för paginering.
tr: Geçersiz sayfalandırma parametreleri.

source: Maximum number of %(count)s results have been reached.
ar: لقد تم الوصول إلى الحد الأقصى لعدد النتائج %(count)s.
cs: Byl dosažen maximální počet %(count)s výsledků.
de: Maximale Anzahl von %(count)s Ergebnissen erreicht.
fi: Tulosten enimmäismäärä %(count)s on saavutettu.
hu: Elértük a maximális %(count)s számú találatot.
sv: Det maximala antalet %(count)s resultat har uppnåtts.
tr: Maksimum %(count)s sonuç sayısına ulaşıldı.
